GopalSaraf/Practicals/PSDL/include/proc/pic16lf19197.h
extern volatile __bit                   RF6PPS1             __at(0xF1F1);	// @ (0x1E3E * 8 + 1)
#define                                 RF6PPS1_bit         _BIT_ACCESS(RF6PPS,1)
// RF6PPS<RF6PPS2>
extern volatile __bit                   RF6PPS2             __at(0xF1F2);	// @ (0x1E3E * 8 + 2)
#define                                 RF6PPS2_bit         _BIT_ACCESS(RF6PPS,2)
// RF6PPS<RF6PPS3>
extern volatile __bit                   RF6PPS3             __at(0xF1F3);	// @ (0x1E3E * 8 + 3)
#define                                 RF6PPS3_bit         _BIT_ACCESS(RF6PPS,3)
// RF6PPS<RF6PPS4>
extern volatile __bit                   RF6PPS4             __at(0xF1F4);	// @ (0x1E3E * 8 + 4)
#define                                 RF6PPS4_bit         _BIT_ACCESS(RF6PPS,4)
// RF6PPS<RF6PPS5>
extern volatile __bit                   RF6PPS5             __at(0xF1F5);	// @ (0x1E3E * 8 + 5)
#define                                 RF6PPS5_bit         _BIT_ACCESS(RF6PPS,5)
// PORTF<RF7>
extern volatile __bit                   RF7                 __at(0x8F);	// @ (0x11 * 8 + 7)
#define                                 RF7_bit             _BIT_ACCESS(PORTF,7)
// RF7PPS<RF7PPS0>
extern volatile __bit                   RF7PPS0             __at(0xF1F8);	// @ (0x1E3F * 8 + 0)
#define                                 RF7PPS0_bit         _BIT_ACCESS(RF7PPS,0)
// RF7PPS<RF7PPS1>
extern volatile __bit                   RF7PPS1             __at(0xF1F9);	// @ (0x1E3F * 8 + 1)
#define                                 RF7PPS1_bit         _BIT_ACCESS(RF7PPS,1)
// RF7PPS<RF7PPS2>
extern volatile __bit                   RF7PPS2             __at(0xF1FA);	// @ (0x1E3F * 8 + 2)
#define                                 RF7PPS2_bit         _BIT_ACCESS(RF7PPS,2)
// RF7PPS<RF7PPS3>
extern volatile __bit                   RF7PPS3             __at(0xF1FB);	// @ (0x1E3F * 8 + 3)
#define                                 RF7PPS3_bit         _BIT_ACCESS(RF7PPS,3)
// RF7PPS<RF7PPS4>
extern volatile __bit                   RF7PPS4             __at(0xF1FC);	// @ (0x1E3F * 8 + 4)
#define                                 RF7PPS4_bit         _BIT_ACCESS(RF7PPS,4)
// RF7PPS<RF7PPS5>
extern volatile __bit                   RF7PPS5             __at(0xF1FD);	// @ (0x1E3F * 8 + 5)
#define                                 RF7PPS5_bit         _BIT_ACCESS(RF7PPS,5)
// PORTG<RG0>
extern volatile __bit                   RG0                 __at(0x6460);	// @ (0xC8C * 8 + 0)
#define                                 RG0_bit             _BIT_ACCESS(PORTG,0)
// RG0PPS<RG0PPS0>
extern volatile __bit                   RG0PPS0             __at(0xF200);	// @ (0x1E40 * 8 + 0)
#define                                 RG0PPS0_bit         _BIT_ACCESS(RG0PPS,0)
// RG0PPS<RG0PPS1>
extern volatile __bit                   RG0PPS1             __at(0xF201);	// @ (0x1E40 * 8 + 1)
#define                                 RG0PPS1_bit         _BIT_ACCESS(RG0PPS,1)
// RG0PPS<RG0PPS2>
extern volatile __bit                   RG0PPS2             __at(0xF202);	// @ (0x1E40 * 8 + 2)
#define                                 RG0PPS2_bit         _BIT_ACCESS(RG0PPS,2)
// RG0PPS<RG0PPS3>
extern volatile __bit                   RG0PPS3             __at(0xF203);	// @ (0x1E40 * 8 + 3)
#define                                 RG0PPS3_bit         _BIT_ACCESS(RG0PPS,3)
// RG0PPS<RG0PPS4>
extern volatile __bit                   RG0PPS4             __at(0xF204);	// @ (0x1E40 * 8 + 4)
#define                                 RG0PPS4_bit         _BIT_ACCESS(RG0PPS,4)
// RG0PPS<RG0PPS5>
extern volatile __bit                   RG0PPS5             __at(0xF205);	// @ (0x1E40 * 8 + 5)
#define                                 RG0PPS5_bit         _BIT_ACCESS(RG0PPS,5)
// PORTG<RG1>
extern volatile __bit                   RG1                 __at(0x6461);	// @ (0xC8C * 8 + 1)
#define                                 RG1_bit             _BIT_ACCESS(PORTG,1)
// RG1PPS<RG1PPS0>
extern volatile __bit                   RG1PPS0             __at(0xF208);	// @ (0x1E41 * 8 + 0)
#define                                 RG1PPS0_bit         _BIT_ACCESS(RG1PPS,0)
// RG1PPS<RG1PPS1>
extern volatile __bit                   RG1PPS1             __at(0xF209);	// @ (0x1E41 * 8 + 1)
#define                                 RG1PPS1_bit         _BIT_ACCESS(RG1PPS,1)
// RG1PPS<RG1PPS2>
extern volatile __bit                   RG1PPS2             __at(0xF20A);	// @ (0x1E41 * 8 + 2)
#define                                 RG1PPS2_bit         _BIT_ACCESS(RG1PPS,2)
// RG1PPS<RG1PPS3>
extern volatile __bit                   RG1PPS3             __at(0xF20B);	// @ (0x1E41 * 8 + 3)
#define                                 RG1PPS3_bit         _BIT_ACCESS(RG1PPS,3)
// RG1PPS<RG1PPS4>
extern volatile __bit                   RG1PPS4             __at(0xF20C);	// @ (0x1E41 * 8 + 4)
#define                                 RG1PPS4_bit         _BIT_ACCESS(RG1PPS,4)
// RG1PPS<RG1PPS5>
extern volatile __bit                   RG1PPS5             __at(0xF20D);	// @ (0x1E41 * 8 + 5)
#define                                 RG1PPS5_bit         _BIT_ACCESS(RG1PPS,5)
// PORTG<RG2>
extern volatile __bit                   RG2                 __at(0x6462);	// @ (0xC8C * 8 + 2)
#define                                 RG2_bit             _BIT_ACCESS(PORTG,2)
// RG2PPS<RG2PPS0>
extern volatile __bit                   RG2PPS0             __at(0xF210);	// @ (0x1E42 * 8 + 0)
#define                                 RG2PPS0_bit         _BIT_ACCESS(RG2PPS,0)
// RG2PPS<RG2PPS1>
extern volatile __bit                   RG2PPS1             __at(0xF211);	// @ (0x1E42 * 8 + 1)
#define                                 RG2PPS1_bit         _BIT_ACCESS(RG2PPS,1)
// RG2PPS<RG2PPS2>
extern volatile __bit                   RG2PPS2             __at(0xF212);	// @ (0x1E42 * 8 + 2)
#define                                 RG2PPS2_bit         _BIT_ACCESS(RG2PPS,2)
// RG2PPS<RG2PPS3>
extern volatile __bit                   RG2PPS3             __at(0xF213);	// @ (0x1E42 * 8 + 3)
#define                                 RG2PPS3_bit         _BIT_ACCESS(RG2PPS,3)
// RG2PPS<RG2PPS4>
extern volatile __bit                   RG2PPS4             __at(0xF214);	// @ (0x1E42 * 8 + 4)
#define                                 RG2PPS4_bit         _BIT_ACCESS(RG2PPS,4)
// RG2PPS<RG2PPS5>
extern volatile __bit                   RG2PPS5             __at(0xF215);	// @ (0x1E42 * 8 + 5)
#define                                 RG2PPS5_bit         _BIT_ACCESS(RG2PPS,5)
// PORTG<RG3>
extern volatile __bit                   RG3                 __at(0x6463);	// @ (0xC8C * 8 + 3)
#define                                 RG3_bit             _BIT_ACCESS(PORTG,3)
// RG3PPS<RG3PPS0>
extern volatile __bit                   RG3PPS0             __at(0xF218);	// @ (0x1E43 * 8 + 0)
#define                                 RG3PPS0_bit         _BIT_ACCESS(RG3PPS,0)
// RG3PPS<RG3PPS1>
extern volatile __bit                   RG3PPS1             __at(0xF219);	// @ (0x1E43 * 8 + 1)
#define                                 RG3PPS1_bit         _BIT_ACCESS(RG3PPS,1)
// RG3PPS<RG3PPS2>
extern volatile __bit                   RG3PPS2             __at(0xF21A);	// @ (0x1E43 * 8 + 2)
#define                                 RG3PPS2_bit         _BIT_ACCESS(RG3PPS,2)
// RG3PPS<RG3PPS3>
extern volatile __bit                   RG3PPS3             __at(0xF21B);	// @ (0x1E43 * 8 + 3)
#define                                 RG3PPS3_bit         _BIT_ACCESS(RG3PPS,3)
// RG3PPS<RG3PPS4>
extern volatile __bit                   RG3PPS4             __at(0xF21C);	// @ (0x1E43 * 8 + 4)
#define                                 RG3PPS4_bit         _BIT_ACCESS(RG3PPS,4)
// RG3PPS<RG3PPS5>
extern volatile __bit                   RG3PPS5             __at(0xF21D);	// @ (0x1E43 * 8 + 5)
#define                                 RG3PPS5_bit         _BIT_ACCESS(RG3PPS,5)
// PORTG<RG4>
extern volatile __bit                   RG4                 __at(0x6464);	// @ (0xC8C * 8 + 4)
#define                                 RG4_bit             _BIT_ACCESS(PORTG,4)
// RG4PPS<RG4PPS0>
extern volatile __bit                   RG4PPS0             __at(0xF220);	// @ (0x1E44 * 8 + 0)
#define                                 RG4PPS0_bit         _BIT_ACCESS(RG4PPS,0)
// RG4PPS<RG4PPS1>
extern volatile __bit                   RG4PPS1             __at(0xF221);	// @ (0x1E44 * 8 + 1)
#define                                 RG4PPS1_bit         _BIT_ACCESS(RG4PPS,1)
// RG4PPS<RG4PPS2>
extern volatile __bit                   RG4PPS2             __at(0xF222);	// @ (0x1E44 * 8 + 2)
#define                                 RG4PPS2_bit         _BIT_ACCESS(RG4PPS,2)
// RG4PPS<RG4PPS3>
extern volatile __bit                   RG4PPS3             __at(0xF223);	// @ (0x1E44 * 8 + 3)
#define                                 RG4PPS3_bit         _BIT_ACCESS(RG4PPS,3)
// RG4PPS<RG4PPS4>
extern volatile __bit                   RG4PPS4             __at(0xF224);	// @ (0x1E44 * 8 + 4)
#define                                 RG4PPS4_bit         _BIT_ACCESS(RG4PPS,4)
// RG4PPS<RG4PPS5>
extern volatile __bit                   RG4PPS5             __at(0xF225);	// @ (0x1E44 * 8 + 5)
#define                                 RG4PPS5_bit         _BIT_ACCESS(RG4PPS,5)
// PORTG<RG5>
extern volatile __bit                   RG5                 __at(0x6465);	// @ (0xC8C * 8 + 5)
#define                                 RG5_bit             _BIT_ACCESS(PORTG,5)
// PORTG<RG6>
extern volatile __bit                   RG6                 __at(0x6466);	// @ (0xC8C * 8 + 6)
#define                                 RG6_bit             _BIT_ACCESS(PORTG,6)
// RG6PPS<RG6PPS0>
extern volatile __bit                   RG6PPS0             __at(0xF230);	// @ (0x1E46 * 8 + 0)
#define                                 RG6PPS0_bit         _BIT_ACCESS(RG6PPS,0)
// RG6PPS<RG6PPS1>
extern volatile __bit                   RG6PPS1             __at(0xF231);	// @ (0x1E46 * 8 + 1)
#define                                 RG6PPS1_bit         _BIT_ACCESS(RG6PPS,1)
// RG6PPS<RG6PPS2>
extern volatile __bit                   RG6PPS2             __at(0xF232);	// @ (0x1E46 * 8 + 2)
#define                                 RG6PPS2_bit         _BIT_ACCESS(RG6PPS,2)
// RG6PPS<RG6PPS3>
extern volatile __bit                   RG6PPS3             __at(0xF233);	// @ (0x1E46 * 8 + 3)
#define                                 RG6PPS3_bit         _BIT_ACCESS(RG6PPS,3)
// RG6PPS<RG6PPS4>
extern volatile __bit                   RG6PPS4             __at(0xF234);	// @ (0x1E46 * 8 + 4)
#define                                 RG6PPS4_bit         _BIT_ACCESS(RG6PPS,4)
// RG6PPS<RG6PPS5>
extern volatile __bit                   RG6PPS5             __at(0xF235);	// @ (0x1E46 * 8 + 5)
#define                                 RG6PPS5_bit         _BIT_ACCESS(RG6PPS,5)
// PORTG<RG7>
extern volatile __bit                   RG7                 __at(0x6467);	// @ (0xC8C * 8 + 7)
#define                                 RG7_bit             _BIT_ACCESS(PORTG,7)
// RG7PPS<RG7PPS0>
extern volatile __bit                   RG7PPS0             __at(0xF238);	// @ (0x1E47 * 8 + 0)
#define                                 RG7PPS0_bit         _BIT_ACCESS(RG7PPS,0)
// RG7PPS<RG7PPS1>
extern volatile __bit                   RG7PPS1             __at(0xF239);	// @ (0x1E47 * 8 + 1)
#define                                 RG7PPS1_bit         _BIT_ACCESS(RG7PPS,1)
// RG7PPS<RG7PPS2>
extern volatile __bit                   RG7PPS2             __at(0xF23A);	// @ (0x1E47 * 8 + 2)
#define                                 RG7PPS2_bit         _BIT_ACCESS(RG7PPS,2)
// RG7PPS<RG7PPS3>
extern volatile __bit                   RG7PPS3             __at(0xF23B);	// @ (0x1E47 * 8 + 3)
#define                                 RG7PPS3_bit         _BIT_ACCESS(RG7PPS,3)
// RG7PPS<RG7PPS4>
extern volatile __bit                   RG7PPS4             __at(0xF23C);	// @ (0x1E47 * 8 + 4)
#define                                 RG7PPS4_bit         _BIT_ACCESS(RG7PPS,4)
// RG7PPS<RG7PPS5>
extern volatile __bit                   RG7PPS5             __at(0xF23D);	// @ (0x1E47 * 8 + 5)
#define                                 RG7PPS5_bit         _BIT_ACCESS(RG7PPS,5)
// PORTH<RH0>
extern volatile __bit                   RH0                 __at(0x6468);	// @ (0xC8D * 8 + 0)
#define                                 RH0_bit             _BIT_ACCESS(PORTH,0)
// RH0PPS<RH0PPS0>
extern volatile __bit                   RH0PPS0             __at(0xF240);	// @ (0x1E48 * 8 + 0)
#define                                 RH0PPS0_bit         _BIT_ACCESS(RH0PPS,0)
// RH0PPS<RH0PPS1>
extern volatile __bit                   RH0PPS1             __at(0xF241);	// @ (0x1E48 * 8 + 1)
#define                                 RH0PPS1_bit         _BIT_ACCESS(RH0PPS,1)
// RH0PPS<RH0PPS2>
extern volatile __bit                   RH0PPS2             __at(0xF242);	// @ (0x1E48 * 8 + 2)
#define                                 RH0PPS2_bit         _BIT_ACCESS(RH0PPS,2)
// RH0PPS<RH0PPS3>
extern volatile __bit                   RH0PPS3             __at(0xF243);	// @ (0x1E48 * 8 + 3)
#define                                 RH0PPS3_bit         _BIT_ACCESS(RH0PPS,3)
// RH0PPS<RH0PPS4>
extern volatile __bit                   RH0PPS4             __at(0xF244);	// @ (0x1E48 * 8 + 4)
#define                                 RH0PPS4_bit         _BIT_ACCESS(RH0PPS,4)
// RH0PPS<RH0PPS5>
extern volatile __bit                   RH0PPS5             __at(0xF245);	// @ (0x1E48 * 8 + 5)
#define                                 RH0PPS5_bit         _BIT_ACCESS(RH0PPS,5)
// PORTH<RH1>
extern volatile __bit                   RH1                 __at(0x6469);	// @ (0xC8D * 8 + 1)
#define                                 RH1_bit             _BIT_ACCESS(PORTH,1)
// RH1PPS<RH1PPS0>
extern volatile __bit                   RH1PPS0             __at(0xF248);	// @ (0x1E49 * 8 + 0)
#define                                 RH1PPS0_bit         _BIT_ACCESS(RH1PPS,0)
// RH1PPS<RH1PPS1>
extern volatile __bit                   RH1PPS1             __at(0xF249);	// @ (0x1E49 * 8 + 1)
#define                                 RH1PPS1_bit         _BIT_ACCESS(RH1PPS,1)
// RH1PPS<RH1PPS2>
extern volatile __bit                   RH1PPS2             __at(0xF24A);	// @ (0x1E49 * 8 + 2)
#define                                 RH1PPS2_bit         _BIT_ACCESS(RH1PPS,2)
// RH1PPS<RH1PPS3>
extern volatile __bit                   RH1PPS3             __at(0xF24B);	// @ (0x1E49 * 8 + 3)
#define                                 RH1PPS3_bit         _BIT_ACCESS(RH1PPS,3)
// RH1PPS<RH1PPS4>
extern volatile __bit                   RH1PPS4             __at(0xF24C);	// @ (0x1E49 * 8 + 4)
#define                                 RH1PPS4_bit         _BIT_ACCESS(RH1PPS,4)
// RH1PPS<RH1PPS5>
extern volatile __bit                   RH1PPS5             __at(0xF24D);	// @ (0x1E49 * 8 + 5)
#define                                 RH1PPS5_bit         _BIT_ACCESS(RH1PPS,5)
// PORTH<RH2>
extern volatile __bit                   RH2                 __at(0x646A);	// @ (0xC8D * 8 + 2)
#define                                 RH2_bit             _BIT_ACCESS(PORTH,2)
// RH2PPS<RH2PPS0>
extern volatile __bit                   RH2PPS0             __at(0xF250);	// @ (0x1E4A * 8 + 0)
#define                                 RH2PPS0_bit         _BIT_ACCESS(RH2PPS,0)
// RH2PPS<RH2PPS1>
extern volatile __bit                   RH2PPS1             __at(0xF251);	// @ (0x1E4A * 8 + 1)
#define                                 RH2PPS1_bit         _BIT_ACCESS(RH2PPS,1)
// RH2PPS<RH2PPS2>
extern volatile __bit                   RH2PPS2             __at(0xF252);	// @ (0x1E4A * 8 + 2)
#define                                 RH2PPS2_bit         _BIT_ACCESS(RH2PPS,2)
// RH2PPS<RH2PPS3>
extern volatile __bit                   RH2PPS3             __at(0xF253);	// @ (0x1E4A * 8 + 3)
#define                                 RH2PPS3_bit         _BIT_ACCESS(RH2PPS,3)
// RH2PPS<RH2PPS4>
extern volatile __bit                   RH2PPS4             __at(0xF254);	// @ (0x1E4A * 8 + 4)
#define                                 RH2PPS4_bit         _BIT_ACCESS(RH2PPS,4)
// RH2PPS<RH2PPS5>
extern volatile __bit                   RH2PPS5             __at(0xF255);	// @ (0x1E4A * 8 + 5)
#define                                 RH2PPS5_bit         _BIT_ACCESS(RH2PPS,5)
// PORTH<RH3>
extern volatile __bit                   RH3                 __at(0x646B);	// @ (0xC8D * 8 + 3)
#define                                 RH3_bit             _BIT_ACCESS(PORTH,3)
// RH3PPS<RH3PPS0>
extern volatile __bit                   RH3PPS0             __at(0xF258);	// @ (0x1E4B * 8 + 0)
#define                                 RH3PPS0_bit         _BIT_ACCESS(RH3PPS,0)
// RH3PPS<RH3PPS1>
extern volatile __bit                   RH3PPS1             __at(0xF259);	// @ (0x1E4B * 8 + 1)
#define                                 RH3PPS1_bit         _BIT_ACCESS(RH3PPS,1)
// RH3PPS<RH3PPS2>
extern volatile __bit                   RH3PPS2             __at(0xF25A);	// @ (0x1E4B * 8 + 2)
#define                                 RH3PPS2_bit         _BIT_ACCESS(RH3PPS,2)
// RH3PPS<RH3PPS3>
extern volatile __bit                   RH3PPS3             __at(0xF25B);	// @ (0x1E4B * 8 + 3)
#define                                 RH3PPS3_bit         _BIT_ACCESS(RH3PPS,3)
// RH3PPS<RH3PPS4>
extern volatile __bit                   RH3PPS4             __at(0xF25C);	// @ (0x1E4B * 8 + 4)
#define                                 RH3PPS4_bit         _BIT_ACCESS(RH3PPS,4)
// RH3PPS<RH3PPS5>
extern volatile __bit                   RH3PPS5             __at(0xF25D);	// @ (0x1E4B * 8 + 5)
#define                                 RH3PPS5_bit         _BIT_ACCESS(RH3PPS,5)
// CPUDOZE<ROI>
extern volatile __bit                   ROI                 __at(0x4465);	// @ (0x88C * 8 + 5)
#define                                 ROI_bit             _BIT_ACCESS(CPUDOZE,5)
// ADRPT<RPT0>
extern volatile __bit                   RPT0                __at(0x4D0);	// @ (0x9A * 8 + 0)
#define                                 RPT0_bit            _BIT_ACCESS(ADRPT,0)
// ADRPT<RPT1>
extern volatile __bit                   RPT1                __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 RPT1_bit            _BIT_ACCESS(ADRPT,1)
// ADRPT<RPT2>
extern volatile __bit                   RPT2                __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 RPT2_bit            _BIT_ACCESS(ADRPT,2)
// ADRPT<RPT3>
extern volatile __bit                   RPT3                __at(0x4D3);	// @ (0x9A * 8 + 3)
#define                                 RPT3_bit            _BIT_ACCESS(ADRPT,3)
// ADRPT<RPT4>
extern volatile __bit                   RPT4                __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 RPT4_bit            _BIT_ACCESS(ADRPT,4)
// ADRPT<RPT5>
extern volatile __bit                   RPT5                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 RPT5_bit            _BIT_ACCESS(ADRPT,5)
// ADRPT<RPT6>
extern volatile __bit                   RPT6                __at(0x4D6);	// @ (0x9A * 8 + 6)
#define                                 RPT6_bit            _BIT_ACCESS(ADRPT,6)
// ADRPT<RPT7>
extern volatile __bit                   RPT7                __at(0x4D7);	// @ (0x9A * 8 + 7)
#define                                 RPT7_bit            _BIT_ACCESS(ADRPT,7)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0xC89);	// @ (0x191 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0xC89);	// @ (0x191 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SMT1STAT<RST>
extern volatile __bit                   RST                 __at(0x24D5);	// @ (0x49A * 8 + 5)
#define                                 RST_bit             _BIT_ACCESS(SMT1STAT,5)
// PIE8<RTCCIE>
extern volatile __bit                   RTCCIE              __at(0x38F6);	// @ (0x71E * 8 + 6)
#define                                 RTCCIE_bit          _BIT_ACCESS(PIE8,6)
// PIR8<RTCCIF>
extern volatile __bit                   RTCCIF              __at(0x38A6);	// @ (0x714 * 8 + 6)
#define                                 RTCCIF_bit          _BIT_ACCESS(PIR8,6)
// RTCCON<RTCCLKSEL0>
extern volatile __bit                   RTCCLKSEL0          __at(0x6060);	// @ (0xC0C * 8 + 0)
#define                                 RTCCLKSEL0_bit      _BIT_ACCESS(RTCCON,0)
// RTCCON<RTCCLKSEL1>
extern volatile __bit                   RTCCLKSEL1          __at(0x6061);	// @ (0xC0C * 8 + 1)
#define                                 RTCCLKSEL1_bit      _BIT_ACCESS(RTCCON,1)
// PMD2<RTCCMD>
extern volatile __bit                   RTCCMD              __at(0x3CC7);	// @ (0x798 * 8 + 7)
#define                                 RTCCMD_bit          _BIT_ACCESS(PMD2,7)
// RTCCON<RTCEN>
extern volatile __bit                   RTCEN               __at(0x6067);	// @ (0xC0C * 8 + 7)
#define                                 RTCEN_bit           _BIT_ACCESS(RTCCON,7)
// RTCCON<RTCSYNC>
extern volatile __bit                   RTCSYNC             __at(0x6064);	// @ (0xC0C * 8 + 4)
#define                                 RTCSYNC_bit         _BIT_ACCESS(RTCCON,4)
// RTCCON<RTCWREN>
extern volatile __bit                   RTCWREN             __at(0x6065);	// @ (0xC0C * 8 + 5)
#define                                 RTCWREN_bit         _BIT_ACCESS(RTCCON,5)
// SSP1STAT<RW>
extern volatile __bit                   RW                  __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// RX1PPS<RX1PPS0>
extern volatile __bit                   RX1PPS0             __at(0xF658);	// @ (0x1ECB * 8 + 0)
#define                                 RX1PPS0_bit         _BIT_ACCESS(RX1PPS,0)
// RX1PPS<RX1PPS1>
extern volatile __bit                   RX1PPS1             __at(0xF659);	// @ (0x1ECB * 8 + 1)
#define                                 RX1PPS1_bit         _BIT_ACCESS(RX1PPS,1)
// RX1PPS<RX1PPS2>
extern volatile __bit                   RX1PPS2             __at(0xF65A);	// @ (0x1ECB * 8 + 2)
#define                                 RX1PPS2_bit         _BIT_ACCESS(RX1PPS,2)
// RX1PPS<RX1PPS3>
extern volatile __bit                   RX1PPS3             __at(0xF65B);	// @ (0x1ECB * 8 + 3)
#define                                 RX1PPS3_bit         _BIT_ACCESS(RX1PPS,3)
// RX1PPS<RX1PPS4>
extern volatile __bit                   RX1PPS4             __at(0xF65C);	// @ (0x1ECB * 8 + 4)
#define                                 RX1PPS4_bit         _BIT_ACCESS(RX1PPS,4)
// RX2PPS<RX2PPS0>
extern volatile __bit                   RX2PPS0             __at(0xF668);	// @ (0x1ECD * 8 + 0)
#define                                 RX2PPS0_bit         _BIT_ACCESS(RX2PPS,0)
// RX2PPS<RX2PPS1>
extern volatile __bit                   RX2PPS1             __at(0xF669);	// @ (0x1ECD * 8 + 1)
#define                                 RX2PPS1_bit         _BIT_ACCESS(RX2PPS,1)
// RX2PPS<RX2PPS2>
extern volatile __bit                   RX2PPS2             __at(0xF66A);	// @ (0x1ECD * 8 + 2)
#define                                 RX2PPS2_bit         _BIT_ACCESS(RX2PPS,2)
// RX2PPS<RX2PPS3>
extern volatile __bit                   RX2PPS3             __at(0xF66B);	// @ (0x1ECD * 8 + 3)
#define                                 RX2PPS3_bit         _BIT_ACCESS(RX2PPS,3)
// RX2PPS<RX2PPS4>
extern volatile __bit                   RX2PPS4             __at(0xF66C);	// @ (0x1ECD * 8 + 4)
#define                                 RX2PPS4_bit         _BIT_ACCESS(RX2PPS,4)
// SSP1STAT<R_W>
extern volatile __bit                   R_W                 __at(0xC7A);	// @ (0x18F * 8 + 2)
