GopalSaraf/Practicals/PSDL/include/proc/pic16lf19197.h
extern volatile __bit                   UTH3                __at(0x473);	// @ (0x8E * 8 + 3)
#define                                 UTH3_bit            _BIT_ACCESS(ADUTHL,3)
// ADUTHL<UTH4>
extern volatile __bit                   UTH4                __at(0x474);	// @ (0x8E * 8 + 4)
#define                                 UTH4_bit            _BIT_ACCESS(ADUTHL,4)
// ADUTHL<UTH5>
extern volatile __bit                   UTH5                __at(0x475);	// @ (0x8E * 8 + 5)
#define                                 UTH5_bit            _BIT_ACCESS(ADUTHL,5)
// ADUTHL<UTH6>
extern volatile __bit                   UTH6                __at(0x476);	// @ (0x8E * 8 + 6)
#define                                 UTH6_bit            _BIT_ACCESS(ADUTHL,6)
// ADUTHL<UTH7>
extern volatile __bit                   UTH7                __at(0x477);	// @ (0x8E * 8 + 7)
#define                                 UTH7_bit            _BIT_ACCESS(ADUTHL,7)
// ADUTHH<UTH8>
extern volatile __bit                   UTH8                __at(0x478);	// @ (0x8F * 8 + 0)
#define                                 UTH8_bit            _BIT_ACCESS(ADUTHH,0)
// ADUTHH<UTH9>
extern volatile __bit                   UTH9                __at(0x479);	// @ (0x8F * 8 + 1)
#define                                 UTH9_bit            _BIT_ACCESS(ADUTHH,1)
// ADSTAT<UTHR>
extern volatile __bit                   UTHR                __at(0x8AE);	// @ (0x115 * 8 + 6)
#define                                 UTHR_bit            _BIT_ACCESS(ADSTAT,6)
// VB0GPR<VB0GPR0>
extern volatile __bit                   VB0GPR0             __at(0x7460);	// @ (0xE8C * 8 + 0)
#define                                 VB0GPR0_bit         _BIT_ACCESS(VB0GPR,0)
// VB0GPR<VB0GPR1>
extern volatile __bit                   VB0GPR1             __at(0x7461);	// @ (0xE8C * 8 + 1)
#define                                 VB0GPR1_bit         _BIT_ACCESS(VB0GPR,1)
// VB0GPR<VB0GPR2>
extern volatile __bit                   VB0GPR2             __at(0x7462);	// @ (0xE8C * 8 + 2)
#define                                 VB0GPR2_bit         _BIT_ACCESS(VB0GPR,2)
// VB0GPR<VB0GPR3>
extern volatile __bit                   VB0GPR3             __at(0x7463);	// @ (0xE8C * 8 + 3)
#define                                 VB0GPR3_bit         _BIT_ACCESS(VB0GPR,3)
// VB0GPR<VB0GPR4>
extern volatile __bit                   VB0GPR4             __at(0x7464);	// @ (0xE8C * 8 + 4)
#define                                 VB0GPR4_bit         _BIT_ACCESS(VB0GPR,4)
// VB0GPR<VB0GPR5>
extern volatile __bit                   VB0GPR5             __at(0x7465);	// @ (0xE8C * 8 + 5)
#define                                 VB0GPR5_bit         _BIT_ACCESS(VB0GPR,5)
// VB0GPR<VB0GPR6>
extern volatile __bit                   VB0GPR6             __at(0x7466);	// @ (0xE8C * 8 + 6)
#define                                 VB0GPR6_bit         _BIT_ACCESS(VB0GPR,6)
// VB0GPR<VB0GPR7>
extern volatile __bit                   VB0GPR7             __at(0x7467);	// @ (0xE8C * 8 + 7)
#define                                 VB0GPR7_bit         _BIT_ACCESS(VB0GPR,7)
// VB1GPR<VB1GPR0>
extern volatile __bit                   VB1GPR0             __at(0x7468);	// @ (0xE8D * 8 + 0)
#define                                 VB1GPR0_bit         _BIT_ACCESS(VB1GPR,0)
// VB1GPR<VB1GPR1>
extern volatile __bit                   VB1GPR1             __at(0x7469);	// @ (0xE8D * 8 + 1)
#define                                 VB1GPR1_bit         _BIT_ACCESS(VB1GPR,1)
// VB1GPR<VB1GPR2>
extern volatile __bit                   VB1GPR2             __at(0x746A);	// @ (0xE8D * 8 + 2)
#define                                 VB1GPR2_bit         _BIT_ACCESS(VB1GPR,2)
// VB1GPR<VB1GPR3>
extern volatile __bit                   VB1GPR3             __at(0x746B);	// @ (0xE8D * 8 + 3)
#define                                 VB1GPR3_bit         _BIT_ACCESS(VB1GPR,3)
// VB1GPR<VB1GPR4>
extern volatile __bit                   VB1GPR4             __at(0x746C);	// @ (0xE8D * 8 + 4)
#define                                 VB1GPR4_bit         _BIT_ACCESS(VB1GPR,4)
// VB1GPR<VB1GPR5>
extern volatile __bit                   VB1GPR5             __at(0x746D);	// @ (0xE8D * 8 + 5)
#define                                 VB1GPR5_bit         _BIT_ACCESS(VB1GPR,5)
// VB1GPR<VB1GPR6>
extern volatile __bit                   VB1GPR6             __at(0x746E);	// @ (0xE8D * 8 + 6)
#define                                 VB1GPR6_bit         _BIT_ACCESS(VB1GPR,6)
// VB1GPR<VB1GPR7>
extern volatile __bit                   VB1GPR7             __at(0x746F);	// @ (0xE8D * 8 + 7)
#define                                 VB1GPR7_bit         _BIT_ACCESS(VB1GPR,7)
// VB2GPR<VB2GPR0>
extern volatile __bit                   VB2GPR0             __at(0x7470);	// @ (0xE8E * 8 + 0)
#define                                 VB2GPR0_bit         _BIT_ACCESS(VB2GPR,0)
// VB2GPR<VB2GPR1>
extern volatile __bit                   VB2GPR1             __at(0x7471);	// @ (0xE8E * 8 + 1)
#define                                 VB2GPR1_bit         _BIT_ACCESS(VB2GPR,1)
// VB2GPR<VB2GPR2>
extern volatile __bit                   VB2GPR2             __at(0x7472);	// @ (0xE8E * 8 + 2)
#define                                 VB2GPR2_bit         _BIT_ACCESS(VB2GPR,2)
// VB2GPR<VB2GPR3>
extern volatile __bit                   VB2GPR3             __at(0x7473);	// @ (0xE8E * 8 + 3)
#define                                 VB2GPR3_bit         _BIT_ACCESS(VB2GPR,3)
// VB2GPR<VB2GPR4>
extern volatile __bit                   VB2GPR4             __at(0x7474);	// @ (0xE8E * 8 + 4)
#define                                 VB2GPR4_bit         _BIT_ACCESS(VB2GPR,4)
// VB2GPR<VB2GPR5>
extern volatile __bit                   VB2GPR5             __at(0x7475);	// @ (0xE8E * 8 + 5)
#define                                 VB2GPR5_bit         _BIT_ACCESS(VB2GPR,5)
// VB2GPR<VB2GPR6>
extern volatile __bit                   VB2GPR6             __at(0x7476);	// @ (0xE8E * 8 + 6)
#define                                 VB2GPR6_bit         _BIT_ACCESS(VB2GPR,6)
// VB2GPR<VB2GPR7>
extern volatile __bit                   VB2GPR7             __at(0x7477);	// @ (0xE8E * 8 + 7)
#define                                 VB2GPR7_bit         _BIT_ACCESS(VB2GPR,7)
// VB3GPR<VB3GPR0>
extern volatile __bit                   VB3GPR0             __at(0x7478);	// @ (0xE8F * 8 + 0)
#define                                 VB3GPR0_bit         _BIT_ACCESS(VB3GPR,0)
// VB3GPR<VB3GPR1>
extern volatile __bit                   VB3GPR1             __at(0x7479);	// @ (0xE8F * 8 + 1)
#define                                 VB3GPR1_bit         _BIT_ACCESS(VB3GPR,1)
// VB3GPR<VB3GPR2>
extern volatile __bit                   VB3GPR2             __at(0x747A);	// @ (0xE8F * 8 + 2)
#define                                 VB3GPR2_bit         _BIT_ACCESS(VB3GPR,2)
// VB3GPR<VB3GPR3>
extern volatile __bit                   VB3GPR3             __at(0x747B);	// @ (0xE8F * 8 + 3)
#define                                 VB3GPR3_bit         _BIT_ACCESS(VB3GPR,3)
// VB3GPR<VB3GPR4>
extern volatile __bit                   VB3GPR4             __at(0x747C);	// @ (0xE8F * 8 + 4)
#define                                 VB3GPR4_bit         _BIT_ACCESS(VB3GPR,4)
// VB3GPR<VB3GPR5>
extern volatile __bit                   VB3GPR5             __at(0x747D);	// @ (0xE8F * 8 + 5)
#define                                 VB3GPR5_bit         _BIT_ACCESS(VB3GPR,5)
// VB3GPR<VB3GPR6>
extern volatile __bit                   VB3GPR6             __at(0x747E);	// @ (0xE8F * 8 + 6)
#define                                 VB3GPR6_bit         _BIT_ACCESS(VB3GPR,6)
// VB3GPR<VB3GPR7>
extern volatile __bit                   VB3GPR7             __at(0x747F);	// @ (0xE8F * 8 + 7)
#define                                 VB3GPR7_bit         _BIT_ACCESS(VB3GPR,7)
// PCON1<VBATBOR>
extern volatile __bit                   VBATBOR             __at(0x40A0);	// @ (0x814 * 8 + 0)
#define                                 VBATBOR_bit         _BIT_ACCESS(PCON1,0)
// LCDPS<WA>
extern volatile __bit                   WA                  __at(0xE86C);	// @ (0x1D0D * 8 + 4)
#define                                 WA_bit              _BIT_ACCESS(LCDPS,4)
// SSP1CON1<WCOL>
extern volatile __bit                   WCOL                __at(0xC87);	// @ (0x190 * 8 + 7)
#define                                 WCOL_bit            _BIT_ACCESS(SSP1CON1,7)
// SSP1CON1<WCOL1>
extern volatile __bit                   WCOL1               __at(0xC87);	// @ (0x190 * 8 + 7)
#define                                 WCOL1_bit           _BIT_ACCESS(SSP1CON1,7)
// WEEKDAY<WDAY0>
extern volatile __bit                   WDAY0               __at(0x6090);	// @ (0xC12 * 8 + 0)
#define                                 WDAY0_bit           _BIT_ACCESS(WEEKDAY,0)
// WEEKDAY<WDAY1>
extern volatile __bit                   WDAY1               __at(0x6091);	// @ (0xC12 * 8 + 1)
#define                                 WDAY1_bit           _BIT_ACCESS(WEEKDAY,1)
// WEEKDAY<WDAY2>
extern volatile __bit                   WDAY2               __at(0x6092);	// @ (0xC12 * 8 + 2)
#define                                 WDAY2_bit           _BIT_ACCESS(WEEKDAY,2)
// WDTCON1<WDTCS0>
extern volatile __bit                   WDTCS0              __at(0x406C);	// @ (0x80D * 8 + 4)
#define                                 WDTCS0_bit          _BIT_ACCESS(WDTCON1,4)
// WDTCON1<WDTCS1>
extern volatile __bit                   WDTCS1              __at(0x406D);	// @ (0x80D * 8 + 5)
#define                                 WDTCS1_bit          _BIT_ACCESS(WDTCON1,5)
// WDTCON1<WDTCS2>
extern volatile __bit                   WDTCS2              __at(0x406E);	// @ (0x80D * 8 + 6)
#define                                 WDTCS2_bit          _BIT_ACCESS(WDTCON1,6)
// WDTCON0<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0x4061);	// @ (0x80C * 8 + 1)
#define                                 WDTPS0_bit          _BIT_ACCESS(WDTCON0,1)
// WDTCON0<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0x4062);	// @ (0x80C * 8 + 2)
#define                                 WDTPS1_bit          _BIT_ACCESS(WDTCON0,2)
// WDTCON0<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0x4063);	// @ (0x80C * 8 + 3)
#define                                 WDTPS2_bit          _BIT_ACCESS(WDTCON0,3)
// WDTCON0<WDTPS3>
extern volatile __bit                   WDTPS3              __at(0x4064);	// @ (0x80C * 8 + 4)
#define                                 WDTPS3_bit          _BIT_ACCESS(WDTCON0,4)
// WDTCON0<WDTPS4>
extern volatile __bit                   WDTPS4              __at(0x4065);	// @ (0x80C * 8 + 5)
#define                                 WDTPS4_bit          _BIT_ACCESS(WDTCON0,5)
// WDTPSL<WDTPSCNT0>
extern volatile __bit                   WDTPSCNT0           __at(0x4070);	// @ (0x80E * 8 + 0)
#define                                 WDTPSCNT0_bit       _BIT_ACCESS(WDTPSL,0)
// WDTPSL<WDTPSCNT1>
extern volatile __bit                   WDTPSCNT1           __at(0x4071);	// @ (0x80E * 8 + 1)
#define                                 WDTPSCNT1_bit       _BIT_ACCESS(WDTPSL,1)
// WDTPSH<WDTPSCNT10>
extern volatile __bit                   WDTPSCNT10          __at(0x407A);	// @ (0x80F * 8 + 2)
#define                                 WDTPSCNT10_bit      _BIT_ACCESS(WDTPSH,2)
// WDTPSH<WDTPSCNT11>
extern volatile __bit                   WDTPSCNT11          __at(0x407B);	// @ (0x80F * 8 + 3)
#define                                 WDTPSCNT11_bit      _BIT_ACCESS(WDTPSH,3)
// WDTPSH<WDTPSCNT12>
extern volatile __bit                   WDTPSCNT12          __at(0x407C);	// @ (0x80F * 8 + 4)
#define                                 WDTPSCNT12_bit      _BIT_ACCESS(WDTPSH,4)
// WDTPSH<WDTPSCNT13>
extern volatile __bit                   WDTPSCNT13          __at(0x407D);	// @ (0x80F * 8 + 5)
#define                                 WDTPSCNT13_bit      _BIT_ACCESS(WDTPSH,5)
// WDTPSH<WDTPSCNT14>
extern volatile __bit                   WDTPSCNT14          __at(0x407E);	// @ (0x80F * 8 + 6)
#define                                 WDTPSCNT14_bit      _BIT_ACCESS(WDTPSH,6)
// WDTPSH<WDTPSCNT15>
extern volatile __bit                   WDTPSCNT15          __at(0x407F);	// @ (0x80F * 8 + 7)
#define                                 WDTPSCNT15_bit      _BIT_ACCESS(WDTPSH,7)
// WDTTMR<WDTPSCNT16>
extern volatile __bit                   WDTPSCNT16          __at(0x4080);	// @ (0x810 * 8 + 0)
#define                                 WDTPSCNT16_bit      _BIT_ACCESS(WDTTMR,0)
// WDTTMR<WDTPSCNT17>
extern volatile __bit                   WDTPSCNT17          __at(0x4081);	// @ (0x810 * 8 + 1)
#define                                 WDTPSCNT17_bit      _BIT_ACCESS(WDTTMR,1)
// WDTPSL<WDTPSCNT2>
extern volatile __bit                   WDTPSCNT2           __at(0x4072);	// @ (0x80E * 8 + 2)
#define                                 WDTPSCNT2_bit       _BIT_ACCESS(WDTPSL,2)
// WDTPSL<WDTPSCNT3>
extern volatile __bit                   WDTPSCNT3           __at(0x4073);	// @ (0x80E * 8 + 3)
#define                                 WDTPSCNT3_bit       _BIT_ACCESS(WDTPSL,3)
// WDTPSL<WDTPSCNT4>
extern volatile __bit                   WDTPSCNT4           __at(0x4074);	// @ (0x80E * 8 + 4)
#define                                 WDTPSCNT4_bit       _BIT_ACCESS(WDTPSL,4)
// WDTPSL<WDTPSCNT5>
extern volatile __bit                   WDTPSCNT5           __at(0x4075);	// @ (0x80E * 8 + 5)
#define                                 WDTPSCNT5_bit       _BIT_ACCESS(WDTPSL,5)
// WDTPSL<WDTPSCNT6>
extern volatile __bit                   WDTPSCNT6           __at(0x4076);	// @ (0x80E * 8 + 6)
#define                                 WDTPSCNT6_bit       _BIT_ACCESS(WDTPSL,6)
// WDTPSL<WDTPSCNT7>
extern volatile __bit                   WDTPSCNT7           __at(0x4077);	// @ (0x80E * 8 + 7)
#define                                 WDTPSCNT7_bit       _BIT_ACCESS(WDTPSL,7)
// WDTPSH<WDTPSCNT8>
extern volatile __bit                   WDTPSCNT8           __at(0x4078);	// @ (0x80F * 8 + 0)
#define                                 WDTPSCNT8_bit       _BIT_ACCESS(WDTPSH,0)
// WDTPSH<WDTPSCNT9>
extern volatile __bit                   WDTPSCNT9           __at(0x4079);	// @ (0x80F * 8 + 1)
#define                                 WDTPSCNT9_bit       _BIT_ACCESS(WDTPSH,1)
// WDTCON0<WDTSEN>
extern volatile __bit                   WDTSEN              __at(0x4060);	// @ (0x80C * 8 + 0)
#define                                 WDTSEN_bit          _BIT_ACCESS(WDTCON0,0)
// WDTTMR<WDTSTATE>
extern volatile __bit                   WDTSTATE            __at(0x4082);	// @ (0x810 * 8 + 2)
#define                                 WDTSTATE_bit        _BIT_ACCESS(WDTTMR,2)
// WDTTMR<WDTTMR0>
extern volatile __bit                   WDTTMR0             __at(0x4083);	// @ (0x810 * 8 + 3)
#define                                 WDTTMR0_bit         _BIT_ACCESS(WDTTMR,3)
// WDTTMR<WDTTMR1>
extern volatile __bit                   WDTTMR1             __at(0x4084);	// @ (0x810 * 8 + 4)
#define                                 WDTTMR1_bit         _BIT_ACCESS(WDTTMR,4)
// WDTTMR<WDTTMR2>
extern volatile __bit                   WDTTMR2             __at(0x4085);	// @ (0x810 * 8 + 5)
#define                                 WDTTMR2_bit         _BIT_ACCESS(WDTTMR,5)
// WDTTMR<WDTTMR3>
extern volatile __bit                   WDTTMR3             __at(0x4086);	// @ (0x810 * 8 + 6)
#define                                 WDTTMR3_bit         _BIT_ACCESS(WDTTMR,6)
// WDTCON1<WDTWINDOW0>
extern volatile __bit                   WDTWINDOW0          __at(0x4068);	// @ (0x80D * 8 + 0)
#define                                 WDTWINDOW0_bit      _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WDTWINDOW1>
extern volatile __bit                   WDTWINDOW1          __at(0x4069);	// @ (0x80D * 8 + 1)
#define                                 WDTWINDOW1_bit      _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WDTWINDOW2>
extern volatile __bit                   WDTWINDOW2          __at(0x406A);	// @ (0x80D * 8 + 2)
#define                                 WDTWINDOW2_bit      _BIT_ACCESS(WDTCON1,2)
// LCDCON<WERR>
extern volatile __bit                   WERR                __at(0xE865);	// @ (0x1D0C * 8 + 5)
#define                                 WERR_bit            _BIT_ACCESS(LCDCON,5)
// LCDPS<WFT>
extern volatile __bit                   WFT                 __at(0xE86F);	// @ (0x1D0D * 8 + 7)
#define                                 WFT_bit             _BIT_ACCESS(LCDPS,7)
// WDTCON1<WINDOW0>
extern volatile __bit                   WINDOW0             __at(0x4068);	// @ (0x80D * 8 + 0)
#define                                 WINDOW0_bit         _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WINDOW1>
extern volatile __bit                   WINDOW1             __at(0x4069);	// @ (0x80D * 8 + 1)
#define                                 WINDOW1_bit         _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WINDOW2>
extern volatile __bit                   WINDOW2             __at(0x406A);	// @ (0x80D * 8 + 2)
#define                                 WINDOW2_bit         _BIT_ACCESS(WDTCON1,2)
// SMT1CON0<WPOL>
extern volatile __bit                   WPOL                __at(0x24C4);	// @ (0x498 * 8 + 4)
#define                                 WPOL_bit            _BIT_ACCESS(SMT1CON0,4)
// WPUA<WPUA0>
extern volatile __bit                   WPUA0               __at(0xF9C8);	// @ (0x1F39 * 8 + 0)
#define                                 WPUA0_bit           _BIT_ACCESS(WPUA,0)
// WPUA<WPUA1>
extern volatile __bit                   WPUA1               __at(0xF9C9);	// @ (0x1F39 * 8 + 1)
#define                                 WPUA1_bit           _BIT_ACCESS(WPUA,1)
// WPUA<WPUA2>
extern volatile __bit                   WPUA2               __at(0xF9CA);	// @ (0x1F39 * 8 + 2)
#define                                 WPUA2_bit           _BIT_ACCESS(WPUA,2)
// WPUA<WPUA3>
extern volatile __bit                   WPUA3               __at(0xF9CB);	// @ (0x1F39 * 8 + 3)
#define                                 WPUA3_bit           _BIT_ACCESS(WPUA,3)
// WPUA<WPUA4>
extern volatile __bit                   WPUA4               __at(0xF9CC);	// @ (0x1F39 * 8 + 4)
#define                                 WPUA4_bit           _BIT_ACCESS(WPUA,4)
// WPUA<WPUA5>
extern volatile __bit                   WPUA5               __at(0xF9CD);	// @ (0x1F39 * 8 + 5)
#define                                 WPUA5_bit           _BIT_ACCESS(WPUA,5)
// WPUA<WPUA6>
extern volatile __bit                   WPUA6               __at(0xF9CE);	// @ (0x1F39 * 8 + 6)
#define                                 WPUA6_bit           _BIT_ACCESS(WPUA,6)
// WPUA<WPUA7>
extern volatile __bit                   WPUA7               __at(0xF9CF);	// @ (0x1F39 * 8 + 7)
#define                                 WPUA7_bit           _BIT_ACCESS(WPUA,7)
// WPUB<WPUB0>
extern volatile __bit                   WPUB0               __at(0xFA20);	// @ (0x1F44 * 8 + 0)
#define                                 WPUB0_bit           _BIT_ACCESS(WPUB,0)
// WPUB<WPUB1>
extern volatile __bit                   WPUB1               __at(0xFA21);	// @ (0x1F44 * 8 + 1)
#define                                 WPUB1_bit           _BIT_ACCESS(WPUB,1)
// WPUB<WPUB2>
extern volatile __bit                   WPUB2               __at(0xFA22);	// @ (0x1F44 * 8 + 2)
#define                                 WPUB2_bit           _BIT_ACCESS(WPUB,2)
// WPUB<WPUB3>
extern volatile __bit                   WPUB3               __at(0xFA23);	// @ (0x1F44 * 8 + 3)
#define                                 WPUB3_bit           _BIT_ACCESS(WPUB,3)
// WPUB<WPUB4>
extern volatile __bit                   WPUB4               __at(0xFA24);	// @ (0x1F44 * 8 + 4)
#define                                 WPUB4_bit           _BIT_ACCESS(WPUB,4)
// WPUB<WPUB5>
extern volatile __bit                   WPUB5               __at(0xFA25);	// @ (0x1F44 * 8 + 5)
#define                                 WPUB5_bit           _BIT_ACCESS(WPUB,5)
// WPUB<WPUB6>
extern volatile __bit                   WPUB6               __at(0xFA26);	// @ (0x1F44 * 8 + 6)
#define                                 WPUB6_bit           _BIT_ACCESS(WPUB,6)
// WPUB<WPUB7>
extern volatile __bit                   WPUB7               __at(0xFA27);	// @ (0x1F44 * 8 + 7)
#define                                 WPUB7_bit           _BIT_ACCESS(WPUB,7)
// WPUC<WPUC0>
extern volatile __bit                   WPUC0               __at(0xFA78);	// @ (0x1F4F * 8 + 0)
#define                                 WPUC0_bit           _BIT_ACCESS(WPUC,0)
// WPUC<WPUC1>
extern volatile __bit                   WPUC1               __at(0xFA79);	// @ (0x1F4F * 8 + 1)
#define                                 WPUC1_bit           _BIT_ACCESS(WPUC,1)
// WPUC<WPUC2>
extern volatile __bit                   WPUC2               __at(0xFA7A);	// @ (0x1F4F * 8 + 2)
#define                                 WPUC2_bit           _BIT_ACCESS(WPUC,2)
// WPUC<WPUC3>
extern volatile __bit                   WPUC3               __at(0xFA7B);	// @ (0x1F4F * 8 + 3)
#define                                 WPUC3_bit           _BIT_ACCESS(WPUC,3)
// WPUC<WPUC4>
extern volatile __bit                   WPUC4               __at(0xFA7C);	// @ (0x1F4F * 8 + 4)
#define                                 WPUC4_bit           _BIT_ACCESS(WPUC,4)
// WPUC<WPUC5>
extern volatile __bit                   WPUC5               __at(0xFA7D);	// @ (0x1F4F * 8 + 5)
#define                                 WPUC5_bit           _BIT_ACCESS(WPUC,5)
// WPUC<WPUC6>
extern volatile __bit                   WPUC6               __at(0xFA7E);	// @ (0x1F4F * 8 + 6)
#define                                 WPUC6_bit           _BIT_ACCESS(WPUC,6)
// WPUC<WPUC7>
extern volatile __bit                   WPUC7               __at(0xFA7F);	// @ (0x1F4F * 8 + 7)
#define                                 WPUC7_bit           _BIT_ACCESS(WPUC,7)
// WPUD<WPUD0>
extern volatile __bit                   WPUD0               __at(0xFAD0);	// @ (0x1F5A * 8 + 0)
#define                                 WPUD0_bit           _BIT_ACCESS(WPUD,0)
// WPUD<WPUD1>
extern volatile __bit                   WPUD1               __at(0xFAD1);	// @ (0x1F5A * 8 + 1)
#define                                 WPUD1_bit           _BIT_ACCESS(WPUD,1)
// WPUD<WPUD2>
extern volatile __bit                   WPUD2               __at(0xFAD2);	// @ (0x1F5A * 8 + 2)
#define                                 WPUD2_bit           _BIT_ACCESS(WPUD,2)
// WPUD<WPUD3>
extern volatile __bit                   WPUD3               __at(0xFAD3);	// @ (0x1F5A * 8 + 3)
#define                                 WPUD3_bit           _BIT_ACCESS(WPUD,3)
// WPUD<WPUD4>
extern volatile __bit                   WPUD4               __at(0xFAD4);	// @ (0x1F5A * 8 + 4)
#define                                 WPUD4_bit           _BIT_ACCESS(WPUD,4)
// WPUD<WPUD5>
extern volatile __bit                   WPUD5               __at(0xFAD5);	// @ (0x1F5A * 8 + 5)
#define                                 WPUD5_bit           _BIT_ACCESS(WPUD,5)
// WPUD<WPUD6>
extern volatile __bit                   WPUD6               __at(0xFAD6);	// @ (0x1F5A * 8 + 6)
#define                                 WPUD6_bit           _BIT_ACCESS(WPUD,6)
// WPUD<WPUD7>
extern volatile __bit                   WPUD7               __at(0xFAD7);	// @ (0x1F5A * 8 + 7)
#define                                 WPUD7_bit           _BIT_ACCESS(WPUD,7)
// WPUE<WPUE0>
extern volatile __bit                   WPUE0               __at(0xFB28);	// @ (0x1F65 * 8 + 0)
#define                                 WPUE0_bit           _BIT_ACCESS(WPUE,0)
// WPUE<WPUE1>
extern volatile __bit                   WPUE1               __at(0xFB29);	// @ (0x1F65 * 8 + 1)
#define                                 WPUE1_bit           _BIT_ACCESS(WPUE,1)
// WPUE<WPUE3>
extern volatile __bit                   WPUE3               __at(0xFB2B);	// @ (0x1F65 * 8 + 3)
#define                                 WPUE3_bit           _BIT_ACCESS(WPUE,3)
// WPUE<WPUE4>
